cf_billing/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

cf_billing/Catalogs/ФизическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ФизическиеЛица</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаРождения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пол</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоРождения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>240</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДляСписка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

cf_billing/CommonModules/энргФизическиеЛица/Ext/Module.bsl
#Область ОбработчикиСобытий

Процедура ФизическиеЛицаПриЗаписиНаСервере(Форма, Отказ, ТекущийОбъект, ПараметрыЗаписи) Экспорт
	
	Перем ДополнительныеСвойства;
	
	ДоступноДобавлениеИзменениеДанныхФизическихЛиц = Пользователи.РолиДоступны("ДобавлениеИзменениеДанныхФизическихЛицЗарплатаКадры");

	ЗаписатьЗаписьДокументыФизическихЛицПослеРедактированияВФорме(Форма, ТекущийОбъект.Ссылка);
	
КонецПроцедуры

Функция ЗаписатьЗаписьДокументыФизическихЛицПослеРедактированияВФорме(Форма, ВедущийОбъект)
	
	Если Форма["ДокументыФизическихЛицНаборЗаписейПрочитан"] Тогда
		Возврат ЗаписатьНаборЗаписейДокументыФизическихЛицПослеРедактированияВФорме(Форма, ВедущийОбъект);
	КонецЕсли;
	
	МетаданныеРегистра = Метаданные.РегистрыСведений["ДокументыФизическихЛиц"];
	ИмяИзмерения = МетаданныеРегистра.Измерения[0].Имя;
	ИзменилисьДанные = Истина;
	
	Если ИзменилисьДанные Тогда
		// пишем новое состояние записи
		МенеджерЗаписи = Форма.РеквизитФормыВЗначение("ДокументыФизическихЛиц");
		МенеджерЗаписи[ИмяИзмерения] = ВедущийОбъект;
		// если нужно сохранить старую запись, то создадим новый менеджер записи
		Если Форма["ДокументыФизическихЛицНоваяЗапись"] Тогда
			НоваяЗапись = РегистрыСведений["ДокументыФизическихЛиц"].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись,  МенеджерЗаписи);
			НоваяЗапись.Записать();
		Иначе
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат ИзменилисьДанные;
	
КонецФункции

Функция ЗаписатьНаборЗаписейДокументыФизическихЛицПослеРедактированияВФорме(Форма, ВедущийОбъект)
	
	ИзменилисьДанные = Ложь;
	
	ОбновитьНаборЗаписейИсторииДокументыФизическихЛиц(Форма, ВедущийОбъект);

	ИмяИзмерения = Метаданные.РегистрыСведений["ДокументыФизическихЛиц"].Измерения[0].Имя;
	
	// Подготовим к сравнению набор исходных сведений
	Набор = РегистрыСведений["ДокументыФизическихЛиц"].СоздатьНаборЗаписей();
	Набор.Отбор[ИмяИзмерения].Установить(ВедущийОбъект);
	Набор.Прочитать();
	ТаблицаИсходногоНабора = Набор.Выгрузить();
	
	// Подготовим к сравнению набор, хранящийся в реквизите формы
	ТаблицаНовогоНабора = Форма["ДокументыФизическихЛицНаборЗаписей"].Выгрузить();
	ТаблицаНовогоНабора.Колонки.Удалить("ИсходныйНомерСтроки");
	
	// Проверим необходимость записи нового набора
	Если НЕ ОбщегоНазначения.КоллекцииИдентичны(ТаблицаИсходногоНабора, ТаблицаНовогоНабора, , "Представление") Тогда
		
		ИзменилисьДанные = Истина;
		МассивСохраняемыхСтрок = Новый Массив;
		
		Для Каждого СтрокаТаблицаНовогоНабора Из ТаблицаНовогоНабора Цикл
			
			СохранитьСтроку = Истина;
			СтрокиТаблицыИсходногоНабора = ТаблицаИсходногоНабора.НайтиСтроки(Новый Структура("Период,ВидДокумента", СтрокаТаблицаНовогоНабора.Период, СтрокаТаблицаНовогоНабора.ВидДокумента));
			Если СтрокиТаблицыИсходногоНабора.Количество() > 0 Тогда
				СтрокаТаблицаИсходногоНабора = СтрокиТаблицыИсходногоНабора[0];
				Если ОбщегоНазначения.КоллекцииИдентичны(ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицаНовогоНабора), ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(СтрокаТаблицаИсходногоНабора), , "Представление") Тогда
					СохранитьСтроку = Ложь;
				КонецЕсли;
				// Удалим строку из таблицы исходного набора
				ТаблицаИсходногоНабора.Удалить(СтрокаТаблицаИсходногоНабора);
			КонецЕсли; 
			
			Если СохранитьСтроку Тогда
				МассивСохраняемыхСтрок.Добавить(СтрокаТаблицаНовогоНабора);
			КонецЕсли; 
			
		КонецЦикла;
		
		Для каждого СтрокаТаблицаИсходногоНабора Из ТаблицаИсходногоНабора Цикл
			УдаляемаяЗапись = РегистрыСведений["ДокументыФизическихЛиц"].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(УдаляемаяЗапись, СтрокаТаблицаИсходногоНабора);
			УдаляемаяЗапись.Удалить();
		КонецЦикла;
		
		Для каждого СтрокаТаблицаНовогоНабора Из МассивСохраняемыхСтрок Цикл
			НоваяЗапись = РегистрыСведений["ДокументыФизическихЛиц"].СоздатьМенеджерЗаписи();
			ЗаполнитьЗначенияСвойств(НоваяЗапись, СтрокаТаблицаНовогоНабора);
			НоваяЗапись.Записать();
		КонецЦикла;
		
	КонецЕсли; 
	
	Возврат ИзменилисьДанные;
	
КонецФункции

Процедура ОбновитьНаборЗаписейИсторииДокументыФизическихЛиц(Форма, ВедущийОбъект) Экспорт
	Перем ЗаписьНабора;
	
	Если Не Форма["ДокументыФизическихЛицНаборЗаписейПрочитан"] Тогда
		
		Форма.ПрочитатьНаборЗаписейПериодическихСведений("ДокументыФизическихЛиц", ВедущийОбъект);
		
	КонецЕсли;
	
	СтруктураЗаписиСтрокой = "";
	ПрежняяЗапись = Новый Структура;
	НужнаЗапятая = Ложь;
	Для Каждого КлючЗначение Из Форма["ДокументыФизическихЛицПрежняя"] Цикл
		Если НужнаЗапятая Тогда
			СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + ",";
		КонецЕсли;
		СтруктураЗаписиСтрокой = СтруктураЗаписиСтрокой + КлючЗначение.Ключ;
		НужнаЗапятая = Истина;
		ПрежняяЗапись.Вставить(КлючЗначение.Ключ);
	КонецЦикла;
		
	Если ЗначениеЗаполнено(Форма["ДокументыФизическихЛиц"].Период) Тогда
		ПериодИзменен = Форма["ДокументыФизическихЛиц"].Период > Форма["ДокументыФизическихЛицПрежняя"].Период;
		РесурсыИзменены = Ложь;
		Для Каждого КлючЗначение Из Форма["ДокументыФизическихЛицПрежняя"] Цикл
			Если КлючЗначение.Ключ = "Период" Тогда
				Продолжить;
			КонецЕсли;
			Если КлючЗначение.Значение <> Форма["ДокументыФизическихЛиц"][КлючЗначение.Ключ] Тогда
				РесурсыИзменены = Истина;
				Прервать;
			КонецЕсли;
		КонецЦикла;
		НаборЗаписей = Форма["ДокументыФизическихЛицНаборЗаписей"];
		Если (ПериодИзменен И РесурсыИзменены) ИЛИ НаборЗаписей.Количество() = 0 Тогда
			ЗаписьНаНовуюДату = НаборЗаписей.НайтиСтроки(Новый Структура("Период,ВидДокумента", Форма["ДокументыФизическихЛиц"].Период, Форма["ДокументыФизическихЛиц"].ВидДокумента));
			Если ЗаписьНаНовуюДату.Количество() = 0 Тогда
				ЗаписьНабора = НаборЗаписей.Добавить();
			КонецЕсли;
		Иначе
			ЗаписьНаНовуюДату = НаборЗаписей.НайтиСтроки(Новый Структура("Период,ВидДокумента", Форма["ДокументыФизическихЛиц"].Период, Форма["ДокументыФизическихЛиц"].ВидДокумента));
			Если ЗаписьНаНовуюДату.Количество() > 0 Тогда
				ЗаписьНабора = ЗаписьНаНовуюДату[0];
			Иначе
				ЗаписьНабора = НаборЗаписей.Добавить();
			КонецЕсли; 
		КонецЕсли;
		
		Если ЗаписьНабора <> НеОпределено Тогда
			
			// Если в этом периоде уже есть документы являющиеся удостоверением личности -.
			// сбросим признак.
			ЯвляющиесяУдостоверениямиЛичности = НаборЗаписей.НайтиСтроки(Новый Структура("Период,ЯвляетсяДокументомУдостоверяющимЛичность", Форма["ДокументыФизическихЛиц"].Период, Истина));
			Для каждого УдостоверениеЛичности Из ЯвляющиесяУдостоверениямиЛичности Цикл
				Если УдостоверениеЛичности.ВидДокумента <> ЗаписьНабора.ВидДокумента Тогда
					УдостоверениеЛичности.ЯвляетсяДокументомУдостоверяющимЛичность = Ложь;
				КонецЕсли; 
			КонецЦикла;
			
			ЗаполнитьЗначенияСвойств(ЗаписьНабора, Форма["ДокументыФизическихЛиц"]);
			НаборЗаписей.Сортировать("Период,ЯвляетсяДокументомУдостоверяющимЛичность");
			
			ЗаполнитьЗначенияСвойств(ПрежняяЗапись, Форма["ДокументыФизическихЛиц"]);
			Форма["ДокументыФизическихЛицПрежняя"] = Новый ФиксированнаяСтруктура(ПрежняяЗапись);
			
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ФизическиеЛицаПриСозданииНаСервере(Форма, Отказ, СтандартнаяОбработка) Экспорт
	
	Если Не Форма.Параметры.Ключ.Пустая() Тогда
		ИнициализироватьЗаписьДляРедактированияВФорме(Форма, "ДокументыФизическихЛиц", Форма.Объект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ИнициализироватьЗаписьДляРедактированияВФорме(Форма, ИмяРегистра, ВедущийОбъект) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
	               |	ДокументыФизическихЛицСрезПоследних.Серия,
	               |	ДокументыФизическихЛицСрезПоследних.Номер,
	               |	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
	               |	ДокументыФизическихЛицСрезПоследних.СрокДействия,
	               |	ДокументыФизическихЛицСрезПоследних.КемВыдан,
	               |	ДокументыФизическихЛицСрезПоследних.КодПодразделения,
	               |	ДокументыФизическихЛицСрезПоследних.Период
	               |ИЗ
	               |	РегистрСведений.ДокументыФизическихЛиц.СрезПоследних(, Физлицо = &Физлицо) КАК ДокументыФизическихЛицСрезПоследних
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ДокументыФизическихЛицСрезПоследних.Серия,
	               |	ДокументыФизическихЛицСрезПоследних.ВидДокумента,
	               |	ДокументыФизическихЛицСрезПоследних.КодПодразделения,
	               |	ДокументыФизическихЛицСрезПоследних.ДатаВыдачи,
	               |	ДокументыФизическихЛицСрезПоследних.Номер,
	               |	ДокументыФизическихЛицСрезПоследних.СрокДействия,
	               |	ДокументыФизическихЛицСрезПоследних.КемВыдан,
	               |	ДокументыФизическихЛицСрезПоследних.Период";
	Запрос.УстановитьПараметр("ФизЛицо", ВедущийОбъект);
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Форма.ДокументыФизическихЛиц, ВЫборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру описывающую временную таблицу отборов для получения истории изменения
// ФИО физических лиц.
//
// Параметры:
//		МенеджерВременныхТаблиц	- МенеджерВременныхТаблиц
//		ИмяВТОтборов			- Строка
//		ИмяПоляФизическоеЛицо	- Строка
//
// Возвращаемое значение:
//		Структура - содержит ключи:
//			* МенеджерВременныхТаблиц	- МенеджерВременныхТаблиц
//			* ИмяВТОтборов				- Строка
//			* ИмяПоляФизическоеЛицо		- Строка
//
Функция ОписательВременныхТаблицДляСоздатьВТИсторияИзмененияФИОФизическихЛиц(МенеджерВременныхТаблиц, ИмяВТОтборов, ИмяПоляФизическоеЛицо) Экспорт
	
	ОписательВТ = Новый Структура;
	
	ОписательВТ.Вставить("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц);
	ОписательВТ.Вставить("ИмяВТОтборов", ИмяВТОтборов);
	ОписательВТ.Вставить("ИмяПоляФизическоеЛицо", ИмяПоляФизическоеЛицо);
	
	Возврат ОписательВТ;
	
КонецФункции

// Создает временную таблицу, содержащую записи регистра сведений ФИОФизическихЛиц,
// по переданному отбору во временной таблице, содержащейся в МенеджереВременныхТаблиц.
//
// Параметры:
//		ТолькоРазрешенные						- Булево
//		ОписательВременныхТаблиц				- Структура (см. ОписательВременныхТаблицДляСоздатьВТИсторияИзмененияФИОФизическихЛиц)
//		ИмяВТИсторияИзмененияФИОФизическихЛиц	- Строка
//
// Возвращаемое значение:
//		РезультатЗапроса
//
Функция СоздатьВТИсторияИзмененияФИОФизическихЛиц(ТолькоРазрешенные, ОписательВременныхТаблиц, ИмяВТИсторияИзмененияФИОФизическихЛиц = "ВТИсторияИзмененияФИОФизическихЛиц") Экспорт
	
	ОписаниеФильтра = ОписаниеФильтраДляСоздатьВТИмяРегистра(ОписательВременныхТаблиц.ИмяВТОтборов, "ФизическоеЛицо");
	ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("ФизическоеЛицо", ОписательВременныхТаблиц.ИмяПоляФизическоеЛицо);
	
	Запрос = ЗапросВТИмяРегистра(
		"ФИОФизическихЛиц",
		ТолькоРазрешенные,
		ОписаниеФильтра,
		,
		ИмяВТИсторияИзмененияФИОФизическихЛиц);
		
	Запрос.МенеджерВременныхТаблиц = ОписательВременныхТаблиц.МенеджерВременныхТаблиц;
	Возврат Запрос.Выполнить();
	
КонецФункции

// Возвращает таблицу значений в строках которой содержится информация о периодах
// изменения (регистрации) фамилии, имени и отчества физических лиц.
//
// Параметры:
//		СписокФизическихЛиц - Массив, ссылок справочника ФизическиеЛица
//							- СправочникСсылка.ФизическиеЛица.
//
// Возвращаемое значение:
//		ТаблицаЗначений - содержит колонки:
//			* Период			- Дата
//			* ФизическоеЛицо	- СправочникСсылка.ФизическиеЛица
//			* Фамилия			- Строка
//			* Имя				- Строка
//			* Отчество			- Строка.
//
Функция ПериодыИзмененияФИОФизическихЛиц(СписокФизическихЛиц) Экспорт
	
	Если ТипЗнч(СписокФизическихЛиц) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
		ФизическиеЛица = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(СписокФизическихЛиц);
	Иначе
		ФизическиеЛица = СписокФизическихЛиц;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("СписокФизическихЛиц", ФизическиеЛица);
	
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаНачала,
		|	ДАТАВРЕМЯ(1, 1, 1) КАК ДатаОкончания,
		|	ФизическиеЛица.Ссылка
		|ПОМЕСТИТЬ ВТОтборФизическихЛиц
		|ИЗ
		|	Справочник.ФизическиеЛица КАК ФизическиеЛица
		|ГДЕ
		|	ФизическиеЛица.Ссылка В(&СписокФизическихЛиц)";
		
	Запрос.Выполнить();
	
	ОписательВТ = ОписательВременныхТаблицДляСоздатьВТИсторияИзмененияФИОФизическихЛиц(
		Запрос.МенеджерВременныхТаблиц,
		"ВТОтборФизическихЛиц",
		"Ссылка");
	
	РезультатЗапроса = СоздатьВТИсторияИзмененияФИОФизическихЛиц(Истина, ОписательВТ, "");
	Возврат РезультатЗапроса.Выгрузить();
	
КонецФункции

#КонецОбласти

#Область ВспомогательныеПроцедурыИФункции

// Возвращает описание источника данных - временная таблица
//
// Параметры:
//		ТаблицаФильтра 		- Строка, имя временной таблицы
//					   		- ТаблицаЗначений
//								содержат обязательные колонки:
//									"Период" (для получения представлений среза первых или
//										среза последних)
//									"ДатаНачала" и "ДатаОкончания" (для получения таблицы регистра)
//		ИзмеренияФильтра 	- Строка, имена колонок таблицы равные именам измерений регистра,
//								по которым устанавливается фильтр, для колонок с именами отличающимися
//								от имен измерений, в значениях ключа "СоответствиеИзмеренийРегистраИзмерениямФильтра",
//								указывается соответствие имени измерения регистра имени колонки таблицы фильтра
//								Допускается не указывать, когда ТаблицаФильтра имеет тип ТаблицаЗначений.
//
// Возвращаемое значение;
//		Структура
//			* ВременнаяТаблица 	- Булево, Истина для источника данных временная таблица, Ложь
//									для источника данных таблица значений
//			* ТаблицаФильтра 	- Строка
//							 	- ТаблицаЗначений
//			* ИзмеренияФильтра 	- Строка
//			* СоответствиеИзмеренийРегистраИзмерениямФильтра - Соответствие.
//
Функция ОписаниеФильтраДляСоздатьВТИмяРегистра(Знач ТаблицаФильтра, Знач ИзмеренияФильтра = "")
	
	ОписаниеФильтра = Новый Структура;
	
	ОписаниеФильтра.Вставить("ВременнаяТаблица", ТипЗнч(ТаблицаФильтра) = Тип("Строка"));
	ОписаниеФильтра.Вставить("ТаблицаФильтра", ТаблицаФильтра);
	ОписаниеФильтра.Вставить("ИзмеренияФильтра", ИзмеренияФильтра);
	ОписаниеФильтра.Вставить("СоответствиеИзмеренийРегистраИзмерениямФильтра", Новый Соответствие);
	
	Возврат ОписаниеФильтра;
	
КонецФункции

// Возвращает запрос представления ВТИмяРегистра
//
// Параметры:
//		ТолькоРазрешенные - Булево
//		ИмяРегистра - Строка, Имя регистра как задано в конфигураторе
//		ПараметрыПостроения - Структура, см.ПараметрыПостроенияПредставленияВТТаблицаРегистра
//		ИмяСоздаваемойТаблицы - Строка, если не указано, запрос будет создавать временную
//					таблицу ВТ<ИмяРегистра>
//
// Возвращаемое значение:
//		Запрос
//
Функция ЗапросВТИмяРегистра(Знач ИмяРегистра, Знач ТолькоРазрешенные, Знач ОписаниеФильтра, ПараметрыПостроения = Неопределено, Знач ИмяСоздаваемойТаблицы = Неопределено)

	Запрос = Новый Запрос;
	
	Если НЕ ОписаниеФильтра.ВременнаяТаблица Тогда
		
		Если НЕ ЗначениеЗаполнено(ОписаниеФильтра.ИзмеренияФильтра) Тогда
			
			МассивИзмерений = Новый Массив;
			Для Каждого Колонка Из ОписаниеФильтра.ТаблицаФильтра.Колонки Цикл
				МассивИзмерений.Добавить(Колонка.Имя);		
			КонецЦикла;	
			
		Иначе
			
			Если ТипЗнч(ОписаниеФильтра.ИзмеренияФильтра) = Тип("Строка") Тогда
				МассивИзмерений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ОписаниеФильтра.ИзмеренияФильтра);
			Иначе
				МассивИзмерений = ОписаниеФильтра.ИзмеренияФильтра;
			КонецЕсли;
			
		КонецЕсли; 
		
		ИмяВТИзмеренияДаты = УникальноеИмяТекстаЗапроса("ВТИзмеренияДаты");
		
		ТекстЗапроса = "ВЫБРАТЬ";
		
		Для Каждого Измерение Из МассивИзмерений Цикл
			ТекстЗапроса = ТекстЗапроса + "
				|	ИзмеренияДаты." + Измерение + " КАК " + Измерение + ",";
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
			|	ИзмеренияДаты.ДатаНачала,
			|	ИзмеренияДаты.ДатаОкончания";
		
		ТекстЗапроса = ТекстЗапроса + "
			|ПОМЕСТИТЬ " + ИмяВТИзмеренияДаты + "
			|ИЗ
			|	&ИзмеренияДаты КАК ИзмеренияДаты";
		
		ИмяПараметраИзмеренияДаты = ИмяВТИзмеренияДаты +"_Параметр";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИзмеренияДаты", "&" + ИмяПараметраИзмеренияДаты);
		ТекстЗапроса = ТекстЗапроса + РазделительЗапросов() + Символы.ПС;
		
		Запрос.УстановитьПараметр(ИмяПараметраИзмеренияДаты, ОписаниеФильтра.ТаблицаФильтра);
		
		ОписаниеФильтра.ВременнаяТаблица = Истина;
		ОписаниеФильтра.ТаблицаФильтра = ИмяВТИзмеренияДаты;
		ОписаниеФильтра.ИзмеренияФильтра = МассивИзмерений;
		
	Иначе
		ТекстЗапроса = "";
	КонецЕсли;
	
	ОписаниеРегистра = ОписаниеРегистраСведений(ИмяРегистра, ОписаниеФильтра.ИзмеренияФильтра);
	
	Если ПараметрыПостроения = Неопределено Тогда
		ПараметрыПостроения = ПараметрыПостроенияДляСоздатьВТИмяРегистра();
	КонецЕсли; 

	ИзмерениеФильтраДатаНачала = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить("ДатаНачала");
	Если ИзмерениеФильтраДатаНачала = Неопределено Тогда
		ИзмерениеФильтраДатаНачала = "ДатаНачала";
	КонецЕсли;
	
	ИзмерениеФильтраДатаОкончания = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить("ДатаОкончания");
	Если ИзмерениеФильтраДатаОкончания = Неопределено Тогда
		ИзмерениеФильтраДатаОкончания = "ДатаОкончания";
	КонецЕсли;
		
	Если ИмяСоздаваемойТаблицы = Неопределено Тогда
		ИмяСоздаваемойТаблицы = "ВТ" + ИмяРегистра;
	КонецЕсли; 
	
	ПараметрыПостроения.ИспользуемоеИмяВременнойТаблицыЗаписейНаНачалоПериода = "";
	
	ФормироватьСПериодичностьДень = ПараметрыПостроения.ФормироватьСПериодичностьДень
		И ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Секунда;
		
	ВключатьЗаписиНаНачалоПериода = ПараметрыПостроения.ВключатьЗаписиНаНачалоПериода
		И (ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Секунда
			ИЛИ ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.День
			ИЛИ ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Месяц
			ИЛИ ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Квартал
			ИЛИ ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Год
		);
	
	Если ВключатьЗаписиНаНачалоПериода Тогда
			
		Если ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Секунда Тогда
			Если ФормироватьСПериодичностьДень Тогда
				ПредставлениеПериода = "ДЕНЬ";
			Иначе
				ПредставлениеПериода = "СЕКУНДА";
			КонецЕсли;
		ИначеЕсли ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.День Тогда
			ПредставлениеПериода = "ДЕНЬ";
		ИначеЕсли ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Месяц Тогда
			ПредставлениеПериода = "МЕСЯЦ";
		ИначеЕсли ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Квартал Тогда
			ПредставлениеПериода = "КВАРТАЛ";
		Иначе
			ПредставлениеПериода = "ГОД";
		КонецЕсли;
		
		Если ПустаяСтрока(ПараметрыПостроения.ИмяВременнойТаблицыЗаписейНаНачалоПериода) Тогда
			ИмяСоздаваемойТаблицыСрезПоследних = УникальноеИмяТекстаЗапроса("ВТ" + ИмяРегистра + "СрезПоследних");
		Иначе
			ИмяСоздаваемойТаблицыСрезПоследних = ПараметрыПостроения.ИмяВременнойТаблицыЗаписейНаНачалоПериода;
		КонецЕсли; 
		
		ПараметрыПостроения.ИспользуемоеИмяВременнойТаблицыЗаписейНаНачалоПериода = ИмяСоздаваемойТаблицыСрезПоследних;
		
		Если ОписаниеФильтра.ВременнаяТаблица Тогда
			ОписаниеФильтраСреза = ОписаниеФильтраДляСоздатьВТИмяРегистра(ОписаниеФильтра.ТаблицаФильтра, ОписаниеФильтра.ИзмеренияФильтра);
		Иначе
			ОписаниеФильтраСреза = ОписаниеФильтраДляСоздатьВТИмяРегистра(ИмяВТИзмеренияДаты, МассивИзмерений);
		КонецЕсли;
		
		ОписаниеФильтраСреза.СоответствиеИзмеренийРегистраИзмерениямФильтра = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра;
		СоответствиеИмениДатаНачала = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить("ДатаНачала");
		Если СоответствиеИмениДатаНачала = Неопределено Тогда
			ИмяКолонкиДатаНачала = "ДатаНачала";
		Иначе
			ИмяКолонкиДатаНачала = СоответствиеИмениДатаНачала;
		КонецЕсли; 
			
		ОписаниеФильтраСреза.СоответствиеИзмеренийРегистраИзмерениямФильтра.Вставить("Период", ИмяКолонкиДатаНачала);
			
		ПараметрыПостроенияСреза = ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
		ПараметрыПостроенияСреза.ФормироватьСПериодичностьДень = ФормироватьСПериодичностьДень;
		Для каждого ОписаниеОтбора Из ПараметрыПостроения.Отборы Цикл
			
			Если ОписаниеОтбора.Свойство("ОтносительныйПуть") Тогда
				ОтносительныйПуть = ОписаниеОтбора.ОтносительныйПуть;
			Иначе
				ОтносительныйПуть = Истина;
			КонецЕсли;
			
			Если ОтносительныйПуть И ОписаниеРегистра.ИзмеренияДляПоиска.Получить(ВРег(ОписаниеОтбора.ЛевоеЗначение)) <> Неопределено Тогда
				ДобавитьВКоллекциюОтбор(ПараметрыПостроенияСреза.Отборы, ОписаниеОтбора.ЛевоеЗначение, ОписаниеОтбора.ВидСравнения, ОписаниеОтбора.ПравоеЗначение, ОтносительныйПуть);
			Иначе
				ДобавитьВКоллекциюОтбор(ПараметрыПостроения.ОтборыЗаписейНаНачалоПериода, ОписаниеОтбора.ЛевоеЗначение, ОписаниеОтбора.ВидСравнения, ОписаниеОтбора.ПравоеЗначение, ОтносительныйПуть);
			КонецЕсли;
			
		КонецЦикла;
		
		ЗапросВТИмяРегистраСрез = ЗапросВТИмяРегистраСрез(ИмяРегистра, ТолькоРазрешенные, ОписаниеФильтраСреза, ПараметрыПостроенияСреза, Истина,  ИмяСоздаваемойТаблицыСрезПоследних);
		
		СкопироватьПараметрыЗапроса(Запрос, ЗапросВТИмяРегистраСрез);
		
		ТекстЗапроса = ТекстЗапроса + ЗапросВТИмяРегистраСрез.Текст + РазделительЗапросов();
		
		ПредставлениеИзмерениеФильтраДатаНачала = "ДОБАВИТЬКДАТЕ(ИзмеренияДаты." + ИзмерениеФильтраДатаНачала + ", " + ПредставлениеПериода + ", 1)";
		
	Иначе
		ПредставлениеИзмерениеФильтраДатаНачала = "ИзмеренияДаты." + ИзмерениеФильтраДатаНачала;
	КонецЕсли; 
	
	Если ФормироватьСПериодичностьДень Тогда
		
		ПредставлениеРегистрСведенийПериод = "НАЧАЛОПЕРИОДА(РегистрСведений.Период, ДЕНЬ)";
		
		ПредставлениеУсловияИзмеренияДатыДатаНачала = "НАЧАЛОПЕРИОДА(" + ПредставлениеИзмерениеФильтраДатаНачала + ", ДЕНЬ)";
		ПредставлениеУсловияИзмеренияДатыДатаОкончания = "КОНЕЦПЕРИОДА(ИзмеренияДаты." + ИзмерениеФильтраДатаОкончания + ", ДЕНЬ)";
		
	Иначе
		
		ПредставлениеРегистрСведенийПериод = "РегистрСведений.Период";
		
		ПредставлениеУсловияИзмеренияДатыДатаНачала = ПредставлениеИзмерениеФильтраДатаНачала;
		ПредставлениеУсловияИзмеренияДатыДатаОкончания = "ИзмеренияДаты." + ИзмерениеФильтраДатаОкончания;
		
	КонецЕсли;
	
	ТекстОписанияИзмерений = "";
	
	ТекстОписанияПолей = "	" + ПредставлениеРегистрСведенийПериод + " КАК Период,
		|	РегистрСведений.Период КАК ПериодЗаписи";
	
	Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
			
		ТекстОписанияПолей = ТекстОписанияПолей + ",
			|	РегистрСведений." + Измерение + " КАК " + Измерение;
			
		ТекстОписанияИзмерений = ?(ПустаяСтрока(ТекстОписанияИзмерений), "", ТекстОписанияИзмерений + "," + Символы.ПС)
			+ "	РегистрСведений." + Измерение;
			
	КонецЦикла;
	
	Для Каждого Ресурс Из ОписаниеРегистра.ВозвратныеРесурсы Цикл
		ТекстОписанияПолей = ТекстОписанияПолей + ",
			|	РегистрСведений." + Ресурс + " КАК " + Ресурс;
	КонецЦикла;
	
	Для Каждого Ресурс Из ОписаниеРегистра.Ресурсы Цикл
		ТекстОписанияПолей = ТекстОписанияПолей + ",
			|	РегистрСведений." + Ресурс + " КАК " + Ресурс;
	КонецЦикла;
	
	Для Каждого Реквизит Из ОписаниеРегистра.Реквизиты Цикл
		ТекстОписанияПолей = ТекстОписанияПолей + ",
			|	РегистрСведений." + Реквизит + " КАК " + Реквизит;
	КонецЦикла;
	
	Для Каждого СтандартныйРеквизит Из ОписаниеРегистра.СтандартныеРеквизиты Цикл
		ТекстОписанияПолей = ТекстОписанияПолей + ",
			|	РегистрСведений." + СтандартныйРеквизит + " КАК " + СтандартныйРеквизит;
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|" + ТекстОписанияПолей + "
		|ПОМЕСТИТЬ ВТПредставленияИмяРегистраТаблица
		|ИЗ
		|	РегистрСведений." + ИмяРегистра + " КАК РегистрСведений
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ОписаниеФильтра.ТаблицаФильтра + " КАК ИзмеренияДаты
		|		ПО (ИзмеренияДаты." + ИзмерениеФильтраДатаНачала + " = ДАТАВРЕМЯ(1, 1, 1) ИЛИ РегистрСведений.Период >= " + ПредставлениеУсловияИзмеренияДатыДатаНачала + ")
		|	И (ИзмеренияДаты." + ИзмерениеФильтраДатаОкончания + " = ДАТАВРЕМЯ(1, 1, 1) ИЛИ РегистрСведений.Период <= " + ПредставлениеУсловияИзмеренияДатыДатаОкончания + ") И ";
	
	Для Каждого Измерение Из ОписаниеРегистра.ИзмеренияФильтра Цикл
			
		ИзмерениеФильтра = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить(Измерение);
		Если ИзмерениеФильтра = Неопределено Тогда
			ИзмерениеФильтра = Измерение;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "(ИзмеренияДаты." + ИзмерениеФильтра + " = РегистрСведений." + Измерение + ") И ";
		
	КонецЦикла;
	
	ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 3);
	
	СчПараметров = 1;
	Если ПараметрыПостроения.Отборы <> Неопределено И ПараметрыПостроения.Отборы.Количество() > 0 Тогда
		
		ТекстОтбор = "";
		
		Для Каждого СтруктураОтбора Из ПараметрыПостроения.Отборы Цикл
				
			Если ТипЗнч(СтруктураОтбора.ПравоеЗначение) = Тип("Строка") Тогда
				ОписаниеПараметра = СтруктураОтбора.ПравоеЗначение;
			Иначе
				ИмяПараметра = ИмяСоздаваемойТаблицы +"_Параметр" + СчПараметров;
				ОписаниеПараметра = "&" + ИмяПараметра;
				Запрос.УстановитьПараметр(ИмяПараметра, СтруктураОтбора.ПравоеЗначение);
			КонецЕсли;
			
			Если НЕ СтруктураОтбора.Свойство("ОтносительныйПуть") ИЛИ СтруктураОтбора.ОтносительныйПуть Тогда
				ПредставленияЛевогоЗначение = "РегистрСведений." + СтруктураОтбора.ЛевоеЗначение;
			Иначе
				ПредставленияЛевогоЗначение = СтруктураОтбора.ЛевоеЗначение
			КонецЕсли;
			
			ТекстОтбор = ?(ПустаяСтрока(ТекстОтбор), "", ТекстОтбор + Символы.ПС + Символы.Таб + "И ")
				+ "(" + ПредставленияЛевогоЗначение + " " + СтруктураОтбора.ВидСравнения + " (" + ОписаниеПараметра + "))";
				
			СчПараметров = СчПараметров + 1;
			
		КонецЦикла;	
		
		ТекстОтбор = "
			|ГДЕ
			|	(" + ТекстОтбор + ")";
		
		ТекстЗапроса = ТекстЗапроса + ТекстОтбор;
		
	КонецЕсли;	
	
	ТекстОтборовСКД = "";
	Для каждого Измерение Из ОписаниеРегистра.ИзмеренияФильтра Цикл
		ТекстОтборовСКД = ?(ПустаяСтрока(ТекстОтборовСКД), "", ТекстОтборовСКД + "," + Символы.ПС) + "	РегистрСведений." + Измерение + ".*";
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ТекстОтборовСКД) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|" + ТекстОтборовСКД + "}";
			
	КонецЕсли; 
	
	Если ОписаниеРегистра.ВозвратныеРесурсы.Количество() > 0 Тогда
		
		ТекстОписанияПолейСВозвратнымиРесурсами = СтрЗаменить(ТекстОписанияПолей, "РегистрСведений.Период", "РегистрСведений.ДействуетДо");
		
		Для Каждого Ресурс Из ОписаниеРегистра.ВозвратныеРесурсы Цикл
			
			ТекстОписанияПолейСВозвратнымиРесурсами = СтрЗаменить(ТекстОписанияПолейСВозвратнымиРесурсами, 
				"РегистрСведений." + Ресурс + " КАК " + Ресурс,
				"РегистрСведений." + Ресурс + "ПоОкончании  КАК " + Ресурс);
				
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|" + ТекстОписанияПолейСВозвратнымиРесурсами + "
			|ИЗ
			|	РегистрСведений." + ИмяРегистра + " КАК РегистрСведений
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ОписаниеФильтра.ТаблицаФильтра + " КАК ИзмеренияДаты
			|		ПО (ИзмеренияДаты." + ИзмерениеФильтраДатаНачала + " = ДАТАВРЕМЯ(1, 1, 1) ИЛИ РегистрСведений.ДействуетДо >= " + ПредставлениеУсловияИзмеренияДатыДатаНачала + ")
			|	И (ИзмеренияДаты." + ИзмерениеФильтраДатаОкончания + " = ДАТАВРЕМЯ(1, 1, 1) ИЛИ РегистрСведений.ДействуетДо <= " + ПредставлениеУсловияИзмеренияДатыДатаОкончания + ")
			|	И РегистрСведений.ДействуетДо <> ДАТАВРЕМЯ(1, 1, 1) И ";

		Для Каждого Измерение Из ОписаниеРегистра.ИзмеренияФильтра Цикл
				
			Если ВРег(Измерение) <> ВРег("ДатаНачала") И ВРег(Измерение) <> ВРег("ДатаОкончания") Тогда
				
				ИзмерениеФильтра = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить(Измерение);
				Если ИзмерениеФильтра = Неопределено Тогда
					ИзмерениеФильтра = Измерение;
				КонецЕсли;
				
				ТекстЗапроса = ТекстЗапроса + "(ИзмеренияДаты." + ИзмерениеФильтра + " = РегистрСведений." + Измерение + ") И ";
				
			КонецЕсли;
			
		КонецЦикла;
	
		ТекстЗапроса = Лев(ТекстЗапроса, СтрДлина(ТекстЗапроса) - 3);
		
		ТекстЗапроса = ТекстЗапроса + "
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ИмяРегистра + " КАК РегистрСведенийВспомогательный
			|		ПО РегистрСведений.Период < РегистрСведенийВспомогательный.Период
			|			И РегистрСведений.ДействуетДо >= РегистрСведенийВспомогательный.Период";
			
		Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
				
			ТекстЗапроса = ТекстЗапроса + "
				|			И РегистрСведений." + Измерение + " = РегистрСведенийВспомогательный." + Измерение;
			
		КонецЦикла;
		
		ТекстЗапроса = ТекстЗапроса + "}" + Символы.ПС
			+ "ГДЕ
			|	РегистрСведенийВспомогательный.Период ЕСТЬ NULL";
		
		СчПараметров = 1;
		Если ПараметрыПостроения.Отборы <> Неопределено И ПараметрыПостроения.Отборы.Количество() > 0 Тогда
			
			ТекстОтбор = "
				|	И (";
				
				Для Каждого СтруктураОтбора Из ПараметрыПостроения.Отборы Цикл
					
				Если ТипЗнч(СтруктураОтбора.ПравоеЗначение) = Тип("Строка") Тогда
					ОписаниеПараметра = СтруктураОтбора.ПравоеЗначение;
				Иначе
					ИмяПараметра = ИмяСоздаваемойТаблицы +"_Параметр" + СчПараметров;
					ОписаниеПараметра = "&" + ИмяПараметра;
				КонецЕсли;
				
				Если НЕ СтруктураОтбора.Свойство("ОтносительныйПуть") ИЛИ СтруктураОтбора.ОтносительныйПуть Тогда
					ПредставленияЛевогоЗначение = "РегистрСведений." + СтруктураОтбора.ЛевоеЗначение;
				Иначе
					ПредставленияЛевогоЗначение = СтруктураОтбора.ЛевоеЗначение
				КонецЕсли;
			
				ТекстОтбор = ТекстОтбор + "
					|	(" + ПредставленияЛевогоЗначение + " " + СтруктураОтбора.ВидСравнения + " (" + ОписаниеПараметра + ")) И";
					
				СчПараметров = СчПараметров + 1;
				
			КонецЦикла;	
			
			ТекстОтбор = Лев(ТекстОтбор, СтрДлина(ТекстОтбор) - 1) + ")";
			
			ТекстЗапроса = ТекстЗапроса + ТекстОтбор;
			
		КонецЕсли;	
		
	КонецЕсли;
	
	Если ФормироватьСПериодичностьДень Тогда
		
		ИмяВТМаксимальныеПериодыПоДням = УникальноеИмяТекстаЗапроса("ВТМаксимальныеПериодыПоДням" + ИмяРегистра);
		
		ТекстЗапроса = ТекстЗапроса + РазделительЗапросов() + "
			|ВЫБРАТЬ
			|	РегистрСведений.Период,
			|	МАКСИМУМ(РегистрСведений.ПериодЗаписи) КАК ПериодЗаписи,
			|" + ТекстОписанияИзмерений
			+ "
			|ПОМЕСТИТЬ " + ИмяВТМаксимальныеПериодыПоДням + "
			|ИЗ 
			|	ВТПредставленияИмяРегистраТаблица КАК РегистрСведений
			|
			|СГРУППИРОВАТЬ ПО
			|	РегистрСведений.Период,
			|" + ТекстОписанияИзмерений;
			
		ИмяВТПредставленияВсеЗаписиИмяРегистра = УникальноеИмяТекстаЗапроса("ВТПредставленияВсеЗаписи" + ИмяРегистра);
		ЗаменитьИмяСоздаваемойВременнойТаблицы(ТекстЗапроса, "ВТПредставленияИмяРегистраТаблица", ИмяВТПредставленияВсеЗаписиИмяРегистра);

		ТекстРезультирующегоОписанияПолей = СтрЗаменить(ТекстОписанияПолей,
			"НАЧАЛОПЕРИОДА(РегистрСведений.Период, ДЕНЬ) КАК Период", "РегистрСведений.Период КАК Период");
			
		ТекстРезультирующегоОписанияПолей = СтрЗаменить(ТекстРезультирующегоОписанияПолей,
			"РегистрСведений.Период КАК ПериодЗаписи", "РегистрСведений.ПериодЗаписи КАК ПериодЗаписи");
		
		ТекстЗапроса = ТекстЗапроса + РазделительЗапросов() + "
			|ВЫБРАТЬ
			|" + ТекстРезультирующегоОписанияПолей + "
			|ПОМЕСТИТЬ ВТПредставленияИмяРегистраТаблица
			|ИЗ 
			|	" + ИмяВТМаксимальныеПериодыПоДням + " КАК РегистрСведенийСрез
			|	ВНУТРЕННЕЕ СОЕДИНЕНИЕ " + ИмяВТПредставленияВсеЗаписиИмяРегистра + " КАК РегистрСведений
			|		ПО РегистрСведенийСрез.Период = РегистрСведений.Период
			|			И РегистрСведенийСрез.ПериодЗаписи = РегистрСведений.ПериодЗаписи";
			
		Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
			
			ТекстЗапроса = ТекстЗапроса + "
				|			И РегистрСведенийСрез." + Измерение + " = РегистрСведений." + Измерение;
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВключатьЗаписиНаНачалоПериода Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|
			|ОБЪЕДИНИТЬ ВСЕ
			|
			|ВЫБРАТЬ
			|" + СтрЗаменить(ТекстОписанияПолей, "РегистрСведений.Период КАК ПериодЗаписи", "РегистрСведений.ПериодЗаписи КАК ПериодЗаписи") + "
			|ИЗ 
			|	" + ИмяСоздаваемойТаблицыСрезПоследних + " КАК РегистрСведений
			|ГДЕ
			|	КОНЕЦПЕРИОДА(РегистрСведений.Период, ДЕНЬ) >= РегистрСведений.ПериодЗаписи";
			
		Если ПараметрыПостроения.ОтборыЗаписейНаНачалоПериода <> Неопределено И ПараметрыПостроения.ОтборыЗаписейНаНачалоПериода.Количество() > 0 Тогда
			
			ТекстОтбор = "";
			
			Для Каждого СтруктураОтбора Из ПараметрыПостроения.ОтборыЗаписейНаНачалоПериода Цикл
					
				Если ТипЗнч(СтруктураОтбора.ПравоеЗначение) = Тип("Строка") Тогда
					ОписаниеПараметра = СтруктураОтбора.ПравоеЗначение;
				Иначе
					ИмяПараметра = ИмяСоздаваемойТаблицы +"_Параметр" + СчПараметров;
					ОписаниеПараметра = "&" + ИмяПараметра;
					Запрос.УстановитьПараметр(ИмяПараметра, СтруктураОтбора.ПравоеЗначение);
				КонецЕсли;
				
				Если НЕ СтруктураОтбора.Свойство("ОтносительныйПуть") ИЛИ СтруктураОтбора.ОтносительныйПуть Тогда
					ПредставленияЛевогоЗначение = "РегистрСведений." + СтруктураОтбора.ЛевоеЗначение;
				Иначе
					ПредставленияЛевогоЗначение = СтруктураОтбора.ЛевоеЗначение
				КонецЕсли;
				
				ТекстОтбор = ТекстОтбор + "
					|	И (" + ПредставленияЛевогоЗначение + " " + СтруктураОтбора.ВидСравнения + " (" + ОписаниеПараметра + "))";
					
				СчПараметров = СчПараметров + 1;
				
			КонецЦикла;	
			
			ТекстЗапроса = ТекстЗапроса + ТекстОтбор;
			
		КонецЕсли;	
		
	КонецЕсли;
		
	ДобавитьВТекстЗапросаПоляИндексирования(ТекстЗапроса, ПараметрыПостроения.ИндексироватьПо);
	
	УстановитьВыборкуТолькоРазрешенныхДанных(ТекстЗапроса, ТолькоРазрешенные);
	ЗаменитьИмяСоздаваемойВременнойТаблицы(ТекстЗапроса, "ВТПредставленияИмяРегистраТаблица", ИмяСоздаваемойТаблицы);
	
	Запрос.Текст = ТекстЗапроса;
	
	Возврат Запрос;
	
КонецФункции

// Возвращает запрос представления ВТИмяРегистраСрез
//
// Параметры:
//		ТолькоРазрешенные 		- Булево
//		ИмяРегистра 			- Строка, Имя регистра как задано в конфигураторе
//		ПараметрыПостроения 	- Структура, см.ПараметрыПостроенияПредставленияВТИмяРегистраСрез
//		СрезПоследних			- Булево, если Истина - срез последних, если Ложь - Срез первых
//		ИмяСоздаваемойТаблицы 	- Строка, если не указано, запрос будет создавать временную таблицу
//									ВТ<ИмяРегистра>СрезПоследних или ВТ<ИмяРегистра>СрезПервых
//
// Возвращаемое значение:
//		Запрос
//
Функция ЗапросВТИмяРегистраСрез(Знач ИмяРегистра, Знач ТолькоРазрешенные, Знач ОписаниеФильтра, Знач ПараметрыПостроения = Неопределено, Знач СрезПоследних = Истина, Знач ИмяСоздаваемойТаблицы = Неопределено)

	Запрос = Новый Запрос;
	
	Если НЕ ОписаниеФильтра.ВременнаяТаблица Тогда
		
		Если НЕ ЗначениеЗаполнено(ОписаниеФильтра.ИзмеренияФильтра) Тогда
			
			МассивИзмерений = Новый Массив;
			Для Каждого Колонка Из ОписаниеФильтра.ТаблицаФильтра.Колонки Цикл
				МассивИзмерений.Добавить(Колонка.Имя);		
			КонецЦикла;	
			
		Иначе
			
			Если ТипЗнч(ОписаниеФильтра.ИзмеренияФильтра) = Тип("Строка") Тогда
				МассивИзмерений = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ОписаниеФильтра.ИзмеренияФильтра);
			Иначе
				МассивИзмерений = ОписаниеФильтра.ИзмеренияФильтра;
			КонецЕсли;
			
		КонецЕсли; 
		
		ИмяВТИзмеренияДаты = УникальноеИмяТекстаЗапроса("ВТИзмеренияДаты");
		
		ТекстЗапроса = 
			"ВЫБРАТЬ
			|	ИзмеренияДаты.Период";
			
		Для Каждого Измерение Из МассивИзмерений Цикл
			ТекстЗапроса = ТекстЗапроса + ",
				|	ИзмеренияДаты." + Измерение;
		КонецЦикла;
			
		ТекстЗапроса = ТекстЗапроса + "
			|ПОМЕСТИТЬ " + ИмяВТИзмеренияДаты + "
			|ИЗ
			|	&ИзмеренияДаты КАК ИзмеренияДаты";
		
		ИмяПараметраИзмеренияДаты = ИмяВТИзмеренияДаты +"_Параметр";
		
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "&ИзмеренияДаты", "&" + ИмяПараметраИзмеренияДаты);
		ТекстЗапроса = ТекстЗапроса + РазделительЗапросов() + Символы.ПС;
		
		Запрос.УстановитьПараметр(ИмяПараметраИзмеренияДаты, ОписаниеФильтра.ТаблицаФильтра);
		
		ОписаниеФильтра.ВременнаяТаблица = Истина;
		ОписаниеФильтра.ТаблицаФильтра = ИмяВТИзмеренияДаты;
		ОписаниеФильтра.ИзмеренияФильтра = МассивИзмерений;
		
	Иначе
		ТекстЗапроса = "";
	КонецЕсли;
	
	Если ПараметрыПостроения = Неопределено Тогда
		ПараметрыПостроения = ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез();
	КонецЕсли; 

	ОписаниеРегистра = ОписаниеРегистраСведений(ИмяРегистра, ОписаниеФильтра.ИзмеренияФильтра);

	ИзмерениеФильтраПериод = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить("Период");
	Если ИзмерениеФильтраПериод = Неопределено Тогда
		ИзмерениеФильтраПериод = "Период";
	КонецЕсли;
	
	Если ИмяСоздаваемойТаблицы = Неопределено Тогда
		ИмяСоздаваемойТаблицы = "ВТ" + ИмяРегистра + ?(СрезПоследних,"СрезПоследних","СрезПервых");
	КонецЕсли; 
	
	ИмяВТМаксимальныеПериоды = УникальноеИмяТекстаЗапроса("ВТМаксимальныеПериоды" + ИмяРегистра);
	
	ФормироватьСПериодичностьДень = ПараметрыПостроения.ФормироватьСПериодичностьДень
		И ОписаниеРегистра.Периодичность = Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.Секунда;
	
	Если ФормироватьСПериодичностьДень Тогда
		
		Если СрезПоследних Тогда
			
			Если ПараметрыПостроения.ВключаяГраницу Тогда
				ПредставлениеУсловияИзмеренияДатыПериод = "КОНЕЦПЕРИОДА(ИзмеренияДаты." + ИзмерениеФильтраПериод + ", ДЕНЬ)";	
			Иначе
				ПредставлениеУсловияИзмеренияДатыПериод = "НАЧАЛОПЕРИОДА(ИзмеренияДаты." + ИзмерениеФильтраПериод + ", ДЕНЬ)";	
			КонецЕсли;
			
		Иначе
			
			Если ПараметрыПостроения.ВключаяГраницу Тогда
				ПредставлениеУсловияИзмеренияДатыПериод = "НАЧАЛОПЕРИОДА(ИзмеренияДаты." + ИзмерениеФильтраПериод + ", ДЕНЬ)";	
			Иначе
				ПредставлениеУсловияИзмеренияДатыПериод = "КОНЕЦПЕРИОДА(ИзмеренияДаты." + ИзмерениеФильтраПериод + ", ДЕНЬ)";	
			КонецЕсли;
			
		КонецЕсли;
		
		Если ПараметрыПостроения.ВключаяГраницу Тогда
			ПредставлениеУсловияМаксимальныеПериодыЗаданныйПериод = "КОНЕЦПЕРИОДА(МаксимальныеПериоды.ЗаданныйПериод, ДЕНЬ)";
		Иначе
			ПредставлениеУсловияМаксимальныеПериодыЗаданныйПериод = "НАЧАЛОПЕРИОДА(МаксимальныеПериоды.ЗаданныйПериод, ДЕНЬ)";
		КонецЕсли;
		
	Иначе
		ПредставлениеУсловияИзмеренияДатыПериод = "ИзмеренияДаты." + ИзмерениеФильтраПериод;	
		ПредставлениеУсловияМаксимальныеПериодыЗаданныйПериод = "МаксимальныеПериоды.ЗаданныйПериод";
	КонецЕсли;
	
	ТекстУсловийСКД = "{ВЫБРАТЬ
		|	ЗаданныйПериод";
	
	ТекстЗапроса = ТекстЗапроса + "
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ИзмеренияДаты." + ИзмерениеФильтраПериод + " КАК ЗаданныйПериод";
		
	Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
			
		Если ОписаниеРегистра.ИзмеренияФильтра.Найти(Измерение) <> НеОпределено Тогда
			
			ИзмерениеФильтра = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить(Измерение);
			Если ИзмерениеФильтра = Неопределено Тогда
				ИзмерениеФильтра = Измерение;
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + ",
				|	ИзмеренияДаты." + ИзмерениеФильтра + " КАК " + Измерение;
				
			ТекстУсловийСКД = ТекстУсловийСКД + ",
				|	" + Измерение;
		Иначе
				
			ТекстЗапроса = ТекстЗапроса + ",
				|	РегистрСведений." + Измерение + " КАК " + Измерение;
				
			ТекстУсловийСКД = ТекстУсловийСКД + ",
				|	" + Измерение;
				
		Конецесли;
			
	КонецЦикла;
	
	ТекстУсловийСКД = ТекстУсловийСКД + "}";
	
	Если СрезПоследних Тогда
		
		ТекстЗапроса = ТекстЗапроса + ",
			|	МАКСИМУМ(РегистрСведений.Период) КАК Период
			|ПОМЕСТИТЬ " + ИмяВТМаксимальныеПериоды + "
			|" + ТекстУсловийСКД + "
			|ИЗ
			|	" + ОписаниеФильтра.ТаблицаФильтра + " КАК ИзмеренияДаты
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ИмяРегистра + " КАК РегистрСведений
			|		ПО (РегистрСведений.Период <= " + ПредставлениеУсловияИзмеренияДатыПериод + " ИЛИ ИзмеренияДаты." + ИзмерениеФильтраПериод + " = ДАТАВРЕМЯ(1,1,1,0,0,0))";
			
		Если НЕ ПараметрыПостроения.ВключаяГраницу Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,"<=","<");
		КонецЕсли;
		
	Иначе
		
		ТекстЗапроса = ТекстЗапроса + ",
			|	МИНИМУМ(РегистрСведений.Период) КАК Период
			|ПОМЕСТИТЬ " + ИмяВТМаксимальныеПериоды + "
			|" + ТекстУсловийСКД + "
			|ИЗ
			|	" + ОписаниеФильтра.ТаблицаФильтра + " КАК ИзмеренияДаты
			|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ИмяРегистра + " КАК РегистрСведений
			|		ПО (РегистрСведений.Период >= " + ПредставлениеУсловияИзмеренияДатыПериод + ")";
			
		Если НЕ ПараметрыПостроения.ВключаяГраницу Тогда
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса,">=",">");
		КонецЕсли;
		
	КонецЕсли;
	
	Для Каждого Измерение Из ОписаниеРегистра.ИзмеренияФильтра Цикл
		
		ИзмерениеФильтра = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить(Измерение);
		Если ИзмерениеФильтра = Неопределено Тогда
			ИзмерениеФильтра = Измерение;
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + "
			|			И (РегистрСведений." + Измерение + " = ИзмеренияДаты." + ИзмерениеФильтра + ")";
			
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "}";
	
	Если ПараметрыПостроения.Отборы <> Неопределено И ПараметрыПостроения.Отборы.Количество() > 0 Тогда
		
		СчПараметров = 1;
		
		ТекстОтбор = "";
	
		Для Каждого СтруктураОтбора Из ПараметрыПостроения.Отборы Цикл
				
			Если ТипЗнч(СтруктураОтбора.ПравоеЗначение) = Тип("Строка") Тогда
				ОписаниеПараметра = СтруктураОтбора.ПравоеЗначение;
			Иначе
				
				ИмяПараметра = ИмяСоздаваемойТаблицы +"_Параметр" + СчПараметров;
				ОписаниеПараметра = "&" + ИмяПараметра;
				Запрос.УстановитьПараметр(ИмяПараметра, СтруктураОтбора.ПравоеЗначение);
				
			КонецЕсли;
			
			Если НЕ СтруктураОтбора.Свойство("ОтносительныйПуть") ИЛИ СтруктураОтбора.ОтносительныйПуть Тогда
				ПредставленияЛевогоЗначение = "РегистрСведений." + СтруктураОтбора.ЛевоеЗначение;
			Иначе
				ПредставленияЛевогоЗначение = СтруктураОтбора.ЛевоеЗначение
			КонецЕсли;
			
			ТекстОтбор = ?(ПустаяСтрока(ТекстОтбор), "	И (", ТекстОтбор + Символы.ПС + "	И ") 
				+ "(" + ПредставленияЛевогоЗначение + " " + СтруктураОтбора.ВидСравнения + " (" + ОписаниеПараметра + "))";
				
			СчПараметров = СчПараметров + 1;
			
		КонецЦикла;	
		
		ТекстОтбор = ТекстОтбор + ")";
		ТекстЗапроса = ТекстЗапроса + ТекстОтбор;
		
	КонецЕсли;
	
	Если НЕ ПараметрыПостроения.ВсеЗаписи Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|ГДЕ
			|	(НЕ РегистрСведений.Период ЕСТЬ NULL)";
			
	КонецЕсли;
		
	ТекстОтборовСКД = "";
	Для каждого Измерение Из ОписаниеРегистра.ИзмеренияФильтра Цикл
		ТекстОтборовСКД = ?(ПустаяСтрока(ТекстОтборовСКД), "", ТекстОтборовСКД + "," + Символы.ПС) + "	РегистрСведений." + Измерение + ".*";
	КонецЦикла;
	
	Если НЕ ПустаяСтрока(ТекстОтборовСКД) Тогда
		
		ТекстЗапроса = ТекстЗапроса + "
			|{ГДЕ
			|" + ТекстОтборовСКД + "}";
			
	КонецЕсли; 
	
	ТекстЗапроса = ТекстЗапроса + "
		|
		|СГРУППИРОВАТЬ ПО
		|	ИзмеренияДаты." + ИзмерениеФильтраПериод;
		
	Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
			
		Если ОписаниеРегистра.ИзмеренияФильтра.Найти(Измерение) <> НеОпределено Тогда
			
			ИзмерениеФильтра = ОписаниеФильтра.СоответствиеИзмеренийРегистраИзмерениямФильтра.Получить(Измерение);
			Если ИзмерениеФильтра = Неопределено Тогда
				ИзмерениеФильтра = Измерение;
			КонецЕсли;
			
			ТекстЗапроса = ТекстЗапроса + ",
				|	ИзмеренияДаты." + ИзмерениеФильтра;
				
		Иначе
				
			ТекстЗапроса = ТекстЗапроса + ",
				|	РегистрСведений." + Измерение;
				
		Конецесли;
			
	КонецЦикла;
	
	ТекстУсловийСКД = "{ВЫБРАТЬ
		|	Период,
		|	ПериодЗаписи";

	ТекстЗапроса = ТекстЗапроса + РазделительЗапросов() + 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	МаксимальныеПериоды.ЗаданныйПериод КАК Период,
		|	РегистрСведений.Период КАК ПериодЗаписи";
		
	Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
			
		ТекстЗапроса = ТекстЗапроса + ",
			|	МаксимальныеПериоды." + Измерение + " КАК " + Измерение;
			
		ТекстУсловийСКД = ТекстУсловийСКД + ",
			|	" + Измерение;
			
	КонецЦикла;
	
	Если СрезПоследних Тогда
		
		ТекстЗапросаПолей = "";
		Для Каждого Ресурс Из ОписаниеРегистра.ВозвратныеРесурсы Цикл
			
			ТекстЗапросаПолей = ТекстЗапросаПолей + ",
				|	ВЫБОР
				|		КОГДА РегистрСведений.ДействуетДо = ДАТАВРЕМЯ(1, 1, 1)
				|				ИЛИ РегистрСведений.ДействуетДо >= " + ПредставлениеУсловияМаксимальныеПериодыЗаданныйПериод + " И МаксимальныеПериоды.ЗаданныйПериод <> ДАТАВРЕМЯ(1, 1, 1)
				|			ТОГДА РегистрСведений." + Ресурс + "
				|		ИНАЧЕ РегистрСведений." + Ресурс + "ПоОкончании
				|	КОНЕЦ КАК " + Ресурс;
			
			ТекстУсловийСКД = ТекстУсловийСКД + ",
				|	" + Ресурс;
		
		КонецЦикла;
		
		Если ПараметрыПостроения.ВключаяГраницу Тогда
			ТекстЗапросаПолей = СтрЗаменить(ТекстЗапросаПолей,">=",">");
		КонецЕсли;
		
		ТекстЗапроса = ТекстЗапроса + ТекстЗапросаПолей;
		
	Иначе
		
		Для Каждого Ресурс Из ОписаниеРегистра.ВозвратныеРесурсы Цикл
			
			ТекстЗапроса = ТекстЗапроса + ",
				|	РегистрСведений." + Ресурс + " КАК " + Ресурс;
				
			ТекстЗапроса = ТекстЗапроса + ",
				|	РегистрСведений." + Ресурс + "ПоОкончании КАК " + Ресурс + "ПоОкончании";
				
			ТекстУсловийСКД = ТекстУсловийСКД + ",
				|	" + Ресурс + ",
				|	" + Ресурс + "ПоОкончании";
		
		КонецЦикла;
			
	КонецЕсли;
	
	Для Каждого Ресурс Из ОписаниеРегистра.Ресурсы Цикл
		
		ТекстЗапроса = ТекстЗапроса + ",
			|	РегистрСведений." + Ресурс + " КАК " + Ресурс;
			
		ТекстУсловийСКД = ТекстУсловийСКД + ",
			|	" + Ресурс;
			
	КонецЦикла;
	
	Для Каждого Реквизит Из ОписаниеРегистра.Реквизиты Цикл
		
		ТекстЗапроса = ТекстЗапроса + ",
			|	РегистрСведений." + Реквизит + " КАК " + Реквизит;
			
		ТекстУсловийСКД = ТекстУсловийСКД + ",
			|	" + Реквизит;
			
	КонецЦикла;
	
	Для Каждого СтандартныйРеквизит Из ОписаниеРегистра.СтандартныеРеквизиты Цикл
		
		ТекстЗапроса = ТекстЗапроса + ",
			|	РегистрСведений." + СтандартныйРеквизит + " КАК " + СтандартныйРеквизит;
			
		ТекстУсловийСКД = ТекстУсловийСКД + ",
			|	" + СтандартныйРеквизит;
			
	КонецЦикла;
	
	ТекстЗапроса = ТекстЗапроса + "
		|ПОМЕСТИТЬ ВТПредставленияИмяРегистраСрез
		|	" + ТекстУсловийСКД + "}
		|ИЗ
		|	" + ИмяВТМаксимальныеПериоды + " КАК МаксимальныеПериоды
		|		{ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений." + ИмяРегистра + " КАК РегистрСведений
		|		ПО (РегистрСведений.Период = МаксимальныеПериоды.Период)";
		
	Для Каждого Измерение Из ОписаниеРегистра.Измерения Цикл
			
		ТекстЗапроса = ТекстЗапроса + "
			|			И (РегистрСведений." + Измерение + " = МаксимальныеПериоды." + Измерение + ")";
			
	КонецЦикла;
		
	ТекстЗапроса = ТекстЗапроса + "}";
	
	ДобавитьВТекстЗапросаПоляИндексирования(ТекстЗапроса, ПараметрыПостроения.ИндексироватьПо);
	
	УстановитьВыборкуТолькоРазрешенныхДанных(ТекстЗапроса, ТолькоРазрешенные);
	ЗаменитьИмяСоздаваемойВременнойТаблицы(ТекстЗапроса, "ВТПредставленияИмяРегистраСрез", ИмяСоздаваемойТаблицы);
	
	Запрос.Текст = ТекстЗапроса;
		
	Возврат Запрос;
	
КонецФункции

// Возвращает уникальное имя на основе переданного имени.
//
// Параметры:
//		ИмяТекстаЗапроса - Строка
//
// Возвращаемое значение:
//		Строка
//
Функция УникальноеИмяТекстаЗапроса(Знач ИмяТекстаЗапроса) 
	
	Возврат ИмяТекстаЗапроса + "_" + СтрЗаменить(Строка(Новый УникальныйИдентификатор), "-", "x");
	
КонецФункции

// Возвращает фрагмент текста запроса, отделяющего один запрос от другого
//
Функция РазделительЗапросов() Экспорт
	
	Возврат "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|";
		
КонецФункции

// Возвращает описание регистра сведений
//
// Параметры:
//		ИмяРегистра - Строка, имя регистра сведений, как задано в конфигураторе.
//		ИзмеренияФильтра - Строка, имена измерений, по которым строится фильтр, перечисленные через запятую
//						 - Массив, имен измерений.
//		ИсключатьНеИспользуемые - Булево, если истина из обработки будут исключены имена измерений (реквизитов, ресурсов),
//							чьи имена начинаются со слова "Удалить".
//		
// Возвращаемое значение:
//		Структура:
//			* ИзмеренияФильтра 		- массив имен измерений по которым выполняется отбор.
//			* Измерения 			- массив имен всех измерений регистра.
//			* Ресурсы 				- массив имен ресурсов, которые не имеют "пары" ...ПоОкончании, кроме ДействуетДо.
//			* ВозвратныеРесурсы 	- массив имен ресурсов, которые имеют "пару" с именем ...ПоОкончании.
//			* Реквизиты 			- массив имен всех реквизитов.
// 			* СтандартныеРеквизиты 	- массив имен стандартных реквизитов.
//			* Периодичность 		- Метаданные.СвойстваОбъектов.ПериодичностьРегистраСведений.
//
Функция ОписаниеРегистраСведений(Знач ИмяРегистра, Знач ИзмеренияФильтра, Знач ИсключатьНеИспользуемые = Истина)
	
	Если ТипЗнч(ИзмеренияФильтра) = Тип("Строка") Тогда
		МассивИзмеренийФильтра = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ИзмеренияФильтра);
	Иначе
		МассивИзмеренийФильтра = ИзмеренияФильтра;
	КонецЕсли;
	
	// Измерения для отбора
	ИзмеренияФильтра = Новый Массив;
	Для Каждого Измерение Из МассивИзмеренийФильтра Цикл
		
		Если ВРег(Измерение) = ВРег("Период")
			ИЛИ	ВРег(Измерение) = ВРег("ДатаНачала")
			ИЛИ ВРег(Измерение) = ВРег("ДатаОкончания") Тогда
			
			Продолжить;
			
		КонецЕсли;
		ИзмеренияФильтра.Добавить(Измерение);
		
	КонецЦикла;
	
	РегистрСведенийМетаданные = Метаданные.РегистрыСведений[ИмяРегистра];
	
	// Все измерения
	Измерения = Новый Массив;
	ИзмеренияДляПоиска = Новый Соответствие;
	Для Каждого Измерение Из РегистрСведенийМетаданные.Измерения Цикл
		
		Если ИсключатьНеИспользуемые И ИмяНеИспользуется(Измерение.Имя) Тогда
			Продолжить;
		КонецЕсли; 
		
		Измерения.Добавить(Измерение.Имя);
		ИзмеренияДляПоиска.Вставить(ВРег(Измерение.Имя), Истина);
		
	КонецЦикла;
	
	ЕстьВозвратныеСобытия = Ложь;
	
	// Ресурсы
	Ресурсы = Новый Массив;
	ВозвратныеРесурсы = Новый Массив;
	Для Каждого Ресурс Из РегистрСведенийМетаданные.Ресурсы Цикл
		
		Если ИсключатьНеИспользуемые И ИмяНеИспользуется(Ресурс.Имя) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если ВРег(Ресурс.Имя) = ВРег("ДействуетДо") Тогда
			ЕстьВозвратныеСобытия = Истина;
			Продолжить; // не включаем ресурс ДействуетДо в список получаемых ресурсов
		КонецЕсли;	
		
		Если ВРег(Прав(Ресурс.Имя, 11)) <> ВРег("ПоОкончании") Тогда
			Ресурсы.Добавить(Ресурс.Имя);
		Иначе	
			ВозвратныеРесурсы.Добавить(Лев(Ресурс.Имя, СтрДлина(Ресурс.Имя) - 11));
		КонецЕсли;	
		
	КонецЦикла;
	
	// Удалим из списка "простых" ресурсов те, которые являются "возвратными"
	Для Каждого Ресурс Из ВозвратныеРесурсы Цикл
		ИндексРесурса = Ресурсы.Найти(Ресурс);
		Если ИндексРесурса <> Неопределено Тогда
			Ресурсы.Удалить(ИндексРесурса);
		КонецЕсли;			
	КонецЦикла;
	
	// Реквизиты
	Реквизиты = Новый Массив;
	Для Каждого Реквизит Из РегистрСведенийМетаданные.Реквизиты Цикл
		
		Если ИсключатьНеИспользуемые И ИмяНеИспользуется(Реквизит.Имя) Тогда
			Продолжить;
		КонецЕсли; 
		
		Реквизиты.Добавить(Реквизит.Имя);
		
	КонецЦикла;
	
	// СтандартныеРеквизиты
	СтандартныеРеквизиты = Новый Массив;
	Для Каждого СтандартныйРеквизит Из РегистрСведенийМетаданные.СтандартныеРеквизиты Цикл
		
		Если СтандартныйРеквизит.Имя <> "Период" Тогда
			СтандартныеРеквизиты.Добавить(СтандартныйРеквизит.Имя);
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Новый Структура("ИзмеренияФильтра,Измерения,ВозвратныеРесурсы,Ресурсы,Реквизиты,СтандартныеРеквизиты,Периодичность,ИзмеренияДляПоиска",
							ИзмеренияФильтра, Измерения, ВозвратныеРесурсы, Ресурсы, Реквизиты, СтандартныеРеквизиты, РегистрСведенийМетаданные.ПериодичностьРегистраСведений, ИзмеренияДляПоиска);

КонецФункции

// Проверят на то, что имя поля начинается со слова "Удалить"
//
// Параметры:
//		ИмяПоля - Строка
//
// Возвращаемое значение:
//		Булево
//
Функция ИмяНеИспользуется(Знач ИмяПоля)
	
	Возврат Найти(Врег(ИмяПоля), ВРег("Удалить")) = 1;
	
КонецФункции

// Возвращает параметры построения для СоздатьВТИмяРегистра
//
// Возвращаемое значение;
//		Структура:
//			* ИндексироватьПо 							- Неопределено - см. функцию ПараметрыПостроенияВТИмяРегистра
//			* Отборы 									- Массив - см. функцию ПараметрыПостроенияВТИмяРегистра
//			* ВключатьЗаписиНаНачалоПериода 			- Булево, если истина в результирующую таблицу будут
//															включены значения по измерениям фильтра на начало периода
//															(применимо при построении запросов к регистрам с периодичностью
//															Секунда, День, Месяц, Квартал или Год).
//			* ИмяВременнойТаблицыЗаписейНаНачалоПериода - Строка, задает имя временной таблицы записей на начало периода
//			* ИспользуемоеИмяВременнойТаблицыЗаписейНаНачалоПериода - Строка, по окончании работы метода ЗапросВТИмяРегистра будет
//															сохранено имя временной таблицы, содержащей записи на начало периода,
//															если задано значение ИмяВременнойТаблицыЗаписейНаНачалоПериода, то будет
//															содержать значение ИмяВременнойТаблицыЗаписейНаНачалоПериода.
//			* ОтборыЗаписейНаНачалоПериода 				- Массив, описаний отбора (см.ДобавитьВКоллекциюОтбор), применяется к таблице
//															формирующий записи на начало периода, при формировании результирующей таблицы.
//
Функция ПараметрыПостроенияДляСоздатьВТИмяРегистра()
	
	ПараметрыПостроения = ПараметрыПостроенияВТИмяРегистра();
	ПараметрыПостроения.Вставить("ВключатьЗаписиНаНачалоПериода", Ложь);
	ПараметрыПостроения.Вставить("ИмяВременнойТаблицыЗаписейНаНачалоПериода", "");
	ПараметрыПостроения.Вставить("ИспользуемоеИмяВременнойТаблицыЗаписейНаНачалоПериода", "");
	ПараметрыПостроения.Вставить("ОтборыЗаписейНаНачалоПериода", Неопределено);
	
	Возврат ПараметрыПостроения;
	
КонецФункции

// Возвращает параметры построения для СоздатьВТИмяРегистраСрезПервых
//
// Возвращаемое значение;
//		Структура:
//			* ИндексироватьПо 	- Неопределено 	- см. функцию ПараметрыПостроенияВТИмяРегистра
//			* Отборы 			- Массив 		- см. функцию ПараметрыПостроенияВТИмяРегистра
//			* ВсеЗаписи 		- Булево, если Истина в результирующую таблицу будут включены
//									записи таблицы фильтра, для которых нет записей в регистре
//			* ВключаяГраницу 	- Булево, если Ложь из результирующей таблицы будут исключены
//									записи с периодами равными ограничивающим.
//
Функция ПараметрыПостроенияДляСоздатьВТИмяРегистраСрез()
	
	ПараметрыПостроения = ПараметрыПостроенияВТИмяРегистра();
	ПараметрыПостроения.Вставить("ВсеЗаписи", Ложь);
	ПараметрыПостроения.Вставить("ВключаяГраницу", Истина);
	
	Возврат ПараметрыПостроения;
	
КонецФункции

// Возвращает параметры построения представлений
// 
// Возвращаемое значение;
//		Структура:
//			* ИндексироватьПо 				- Неопределено, в параметре можно указать
//											- Строку, содержащую имена полей регистра по которым
//												будет произведено индексирование, перечисленным через запятую.
//											- Массив, содержащий имена полей регистра.
//			* Отборы 						- Массив, описаний отбора (см. процедуру ДобавитьВКоллекциюОтбор).
//			* ФормироватьСПериодичностьДень - Булево, если Истина сведения будут сформированы по последним записям
//												за день (применяется при получении сведений из регистров сведения
//												с периодичностью равной Секунда).
//
Функция ПараметрыПостроенияВТИмяРегистра()
	
	ПараметрыПостроения = Новый Структура;
	ПараметрыПостроения.Вставить("ИндексироватьПо");
	ПараметрыПостроения.Вставить("Отборы", Новый Массив);
	ПараметрыПостроения.Вставить("ФормироватьСПериодичностьДень", Истина);
	
	Возврат ПараметрыПостроения;
	
КонецФункции

// Осуществляет замену имени временной таблицы. Если не указано новое имя 
// временной таблицы, производится удаление из текста запроса строки, осуществляющей
// создание временной таблицы. Если новое имя временной таблицы передано, то производится
// замена всех фрагментов текста, содержащих старое имя временной таблицы на новое имя.
//
// Параметры:
//	ТекстЗапроса
//	ТекущееИмяТаблицы
//	НовоеИмяТаблицы
//
Процедура ЗаменитьИмяСоздаваемойВременнойТаблицы(ТекстЗапроса, ТекущееИмяТаблицы, НовоеИмяТаблицы = "")
	
	Если ПустаяСтрока(НовоеИмяТаблицы) Тогда
		ЗамещаемыйТекст = "";
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ПОМЕСТИТЬ " + ТекущееИмяТаблицы, "");
	Иначе
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, ТекущееИмяТаблицы, НовоеИмяТаблицы);
	КонецЕсли;
	
КонецПроцедуры

// Добавляет в коллекцию описание отбора
//
// Параметры:
//		КоллекцияОтборов - Массив
//		ЛевоеЗначение - Строка
//		ВидСравнения - Строка, допустимы условия, применяемые в текстах запросов
//		ПравоеЗначение - Любое значение, допустимое в условиях текстов запросов
//		ОтносительныйПуть - Булево, если истина, то в параметре ЛевоеЗначение должно содержаться
//					имя измерения, ресурса, реквизита регистра и перед именем через точку будет
//					подставляться имя таблицы из которой осуществляется выборка.
//
Процедура ДобавитьВКоллекциюОтбор(КоллекцияОтборов, ЛевоеЗначение, ВидСравнения, ПравоеЗначение, ОтносительныйПуть = Истина)
	
	Если КоллекцияОтборов = Неопределено Тогда
		КоллекцияОтборов = Новый Массив;
	КонецЕсли;
	
	ОписаниеОтбора = Новый Структура;
	ОписаниеОтбора.Вставить("ЛевоеЗначение", ЛевоеЗначение);
	ОписаниеОтбора.Вставить("ВидСравнения", ВидСравнения);
	ОписаниеОтбора.Вставить("ПравоеЗначение", ПравоеЗначение);
	ОписаниеОтбора.Вставить("ОтносительныйПуть", ОтносительныйПуть);
	
	КоллекцияОтборов.Добавить(ОписаниеОтбора);
	
КонецПроцедуры

// Копирует параметры запроса ЗапросИсточник в параметры запроса ЗапросПриемник
//
// Параметры:
//		ЗапросПриемник - Запрос
//		ЗапросИсточник - Запрос
//
Процедура СкопироватьПараметрыЗапроса(ЗапросПриемник, ЗапросИсточник)
	
	Для каждого Параметр Из ЗапросИсточник.Параметры Цикл
		
		ЗапросПриемник.УстановитьПараметр(Параметр.Ключ, Параметр.Значение);
		
	КонецЦикла;
	
КонецПроцедуры

// Добавляет к тексту запроса фрагмент индексирования
//
// Параметры:
//		ТекстЗапроса - Строка
//		ПоляИндексирования - см. описание параметра ПоляИндексирования,
//				метода ПараметрыПостроенияПредставленияВТИмяРегистра.
//
Процедура ДобавитьВТекстЗапросаПоляИндексирования(ТекстЗапроса, ПоляИндексирования)
	
	Если ПоляИндексирования <> Неопределено Тогда
		
		Если ТипЗнч(ПоляИндексирования) = Тип("Строка") Тогда
			МассивПолейИндексирования = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(ПоляИндексирования);
		Иначе
			МассивПолейИндексирования = ПоляИндексирования;
		КонецЕсли;
		
		Если МассивПолейИндексирования.Количество() > 0 Тогда
			
			ОписаниеПолейИндексирования = "";
			Для каждого ИмяПоляИндекса Из МассивПолейИндексирования Цикл
				ОписаниеПолейИндексирования = ?(ПустаяСтрока(ОписаниеПолейИндексирования), "", ОписаниеПолейИндексирования + "," + Символы.ПС) + Символы.Таб + ИмяПоляИндекса;
			КонецЦикла;
				
			ТекстЗапроса = ТекстЗапроса + "
				|ИНДЕКСИРОВАТЬ ПО
				|" + ОписаниеПолейИндексирования;
			
		КонецЕсли; 
			
	КонецЕсли; 
	
КонецПроцедуры

// Производит замену ключевой фразы "ВЫБРАТЬ РАЗРЕШЕННЫЕ" на "ВЫБРАТЬ". Предполагается, что
// текст запроса изначально содержит фразу "ВЫБРАТЬ РАЗРЕШЕННЫЕ".
//
// Параметры:
//		ТекстЗапроса - Строка
//		ТолькоРазрешенные - Булево
//
Процедура УстановитьВыборкуТолькоРазрешенныхДанных(ТекстЗапроса, ТолькоРазрешенные)
	
	Если НЕ ТолькоРазрешенные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "ВЫБРАТЬ РАЗРЕШЕННЫЕ", "ВЫБРАТЬ");
	КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти
